tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jstkdng/programs"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "sqitchers/sqitch"
brew "act"
brew "giflib"
brew "libpng"
brew "aom"
brew "bat"
brew "btop"
brew "pixman"
brew "cairo"
brew "pango"
brew "librsvg"
brew "cocoapods"
brew "perl"
brew "cpm"
brew "docker"
brew "eza"
brew "fd"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libass"
brew "librist"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "gnu-sed"
brew "go"
brew "gum"
brew "pkgconf"
brew "imagemagick"
brew "jdtls"
brew "jpeg"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "libfido2"
brew "libsixel"
brew "lua-language-server"
brew "luarocks"
brew "maven"
brew "mysql"
brew "mysql-client"
brew "neovim"
brew "nghttp2"
brew "nvm"
brew "openjdk@21"
brew "pgcli"
brew "pillow"
brew "pipx"
brew "pngpaste"
brew "poppler"
brew "python-setuptools"
brew "ripgrep"
brew "rust-analyzer"
brew "starship"
brew "stylua"
brew "the_silver_searcher"
brew "thefuck"
brew "tlrc"
brew "universal-ctags"
brew "vips"
brew "yazi"
brew "zoxide"
brew "felixkratz/formulae/sketchybar"
brew "jstkdng/programs/ueberzugpp"
cask "anki"
cask "dbeaver-community"
cask "font-droid-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-slab-nerd-font"
cask "font-monaspace"
cask "hammerspoon"
cask "ngrok"
cask "orbstack"
vscode "9beach.vscode-hanspell"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "aeschli.vscode-css-formatter"
vscode "aksharpatel47.vscode-flutter-helper"
vscode "alexisvt.flutter-snippets"
vscode "antfu.unocss"
vscode "astro-build.astro-vscode"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "chakrounanas.turbo-console-log"
vscode "codesandbox-io.codesandbox-projects"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dbankier.vscode-quick-select"
vscode "denoland.vscode-deno"
vscode "developer2006.svg-gallery"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "geriyoco.vscode-image-gallery"
vscode "gornivv.vscode-flutter-files"
vscode "gruntfuggly.todo-tree"
vscode "hirantha.json-to-dart"
vscode "ionic.ionic"
vscode "jock.svg"
vscode "jonkwheeler.styled-components-snippets"
vscode "kevinrose.vsc-python-indent"
vscode "magicstack.edgedb"
vscode "mathiasfrohlich.kotlin"
vscode "meezilla.json"
vscode "mhutchie.git-graph"
vscode "mohsen1.prettify-json"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.remote-explorer"
vscode "njpwerner.autodocstring"
vscode "nrwl.angular-console"
vscode "orta.vscode-jest"
vscode "peterhdd.dartgettersetter"
vscode "redhat.vscode-xml"
vscode "ritwickdey.liveserver"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shinotatwu-ds.file-tree-generator"
vscode "statelyai.stately-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "vue.volar"
vscode "wallabyjs.quokka-vscode"
vscode "xabikos.javascriptsnippets"
