tap "dart-lang/dart"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "jstkdng/programs"
tap "koekeishiya/formulae"
tap "localstack/tap"
tap "nats-io/nats-tools"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "runpod/runpodctl"
tap "sqitchers/sqitch"
brew "act"
brew "ansible"
brew "giflib"
brew "libpng"
brew "aom"
brew "ast-grep"
brew "awscli-local"
brew "backlog-md"
brew "bat"
brew "btop"
brew "pixman"
brew "cairo"
brew "pango"
brew "librsvg"
brew "cloc"
brew "cocoapods"
brew "coreutils"
brew "perl"
brew "cpm"
brew "dbmate"
brew "docker"
brew "libevent"
brew "eza"
brew "fd"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libass"
brew "librist"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "gh"
brew "git"
brew "gnu-sed"
brew "go"
brew "gum"
brew "pkgconf"
brew "imagemagick"
brew "jdtls"
brew "jpeg"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "libfido2"
brew "libsixel"
brew "lua-language-server"
brew "luarocks"
brew "maven"
brew "yt-dlp"
brew "mpv"
brew "mysql-client"
brew "mysql@8.0", link: true
brew "neovim"
brew "nghttp2"
brew "nvm"
brew "nx"
brew "ollama"
brew "openapi-generator"
brew "ripgrep"
brew "opencode"
brew "openjdk@21"
brew "pgcli"
brew "pillow"
brew "pipx"
brew "pngpaste"
brew "poppler"
brew "pre-commit"
brew "pyenv"
brew "python-setuptools"
brew "qrencode"
brew "qsv"
brew "redis"
brew "rust-analyzer"
brew "starship"
brew "stylua"
brew "tbls"
brew "terminal-notifier"
brew "terraform-local"
brew "the_silver_searcher"
brew "thefuck"
brew "tlrc"
brew "tokei"
brew "ultralist"
brew "universal-ctags"
brew "vips"
brew "watchman"
brew "wget"
brew "yazi"
brew "zellij"
brew "zoxide"
brew "dart-lang/dart/dart"
brew "felixkratz/formulae/sketchybar"
brew "hashicorp/tap/terraform"
brew "jstkdng/programs/ueberzugpp"
brew "localstack/tap/localstack-cli"
brew "nats-io/nats-tools/nats"
brew "oven-sh/bun/bun"
brew "runpod/runpodctl/runpodctl"
cask "android-studio"
cask "anki"
cask "brave-browser"
cask "bruno"
cask "capcut"
cask "claude-code"
cask "dbeaver-community"
cask "discord"
cask "drawio"
cask "flutter"
cask "font-droid-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-google-sans-code"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-slab-nerd-font"
cask "font-monaspace"
cask "hammerspoon"
cask "karabiner-elements"
cask "kitty"
cask "ngrok"
cask "obsidian"
cask "orbstack"
cask "raspberry-pi-imager"
cask "visual-studio-code"
cask "vlc"
cask "zulu@17"
vscode "9beach.vscode-hanspell"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "aksharpatel47.vscode-flutter-helper"
vscode "alexisvt.flutter-snippets"
vscode "astro-build.astro-vscode"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbankier.vscode-quick-select"
vscode "dendron.dendron"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "dotjoshjohnson.xml"
vscode "geriyoco.vscode-image-gallery"
vscode "gornivv.vscode-flutter-files"
vscode "gruntfuggly.todo-tree"
vscode "hirantha.json-to-dart"
vscode "ionic.ionic"
vscode "kevinrose.vsc-python-indent"
vscode "mathiasfrohlich.kotlin"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "peterhdd.dartgettersetter"
vscode "redhat.vscode-xml"
vscode "ritwickdey.liveserver"
vscode "shinotatwu-ds.file-tree-generator"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "wallabyjs.quokka-vscode"
